messages = {
    "welcome": "Добро пожаловать в бот MirrorSleep! Нажмите 'Подключиться', чтобы начать.",
    "video": "Видео компании",
    "intro_bed_linen": (
        "Здравствуйте, {name}!\n\n"
        "Благодарим за выбор бренда MirrorSleep.\n"
        "(Категория: {category})\n\n"
        "Наша цель - Ваш отдых и восстановление через прикосновения к премиальным тканям. Уверены, что Вы, как ценитель поистине качественных вещей, по достоинству оцените нашу продукцию.\n\n"
        "Производитель постельного белья MirrorSleep является одним из крупнейших поставщиков премиум текстиля в мире. Благодаря передовым технологиям все наши изделия отвечают высоким требованиям качества и безопасности.\n\n"
        "Мы гарантируем износостойкость, экологичность и гипоаллергенность Вашей покупки. Так как всё сырье, компоненты и красители, используемые нами, постоянно проходят сертификацию и тестирование в зарубежных и отечественных лабораториях.\n\n"
        "Особое внимание в MirrorSleep уделяется эстетики. Наша продукция отличается изысканным внешнем видом. Команда бренда продумываем каждую деталь и создает дизайны, где практичность сочетается с элегантностью и лаконичностью. С помощью наших изделий Вы подчеркнете красоту Вашего дома и создадите неповторимую атмосферу комфорта."
    ),
    "intro_blanket": (
        "Здравствуйте, {name}!\n\n"
        "Благодарим за выбор бренда MirrorSleep.\n"
        "(Категория: {category})\n\n"
        "Наша цель - Ваш отдых и восстановление через прикосновения к премиальным тканям. Уверены, что Вы, как ценитель поистине качественных вещей, по достоинству оцените нашу продукцию."
    ),
    "intro_towel": (
        "Здравствуйте, {name}!\n\n"
        "Благодарим за выбор бренда MirrorSleep.\n"
        "(Категория: {category})\n\n"
        "Наша цель - Ваш отдых и восстановление через прикосновения к премиальным тканям. Уверены, что Вы, как ценитель поистине качественных вещей, по достоинству оцените нашу продукцию."
    ),
    "subscribe": (
        'Приглашаем Вас подписаться на наш <a href="https://t.me/mirrorsleep">Телеграм-канал</a>!\n\n'
        'Вы узнаете много полезной информации о <b>{category}</b> и уходе за ним. Каждую неделю мы проводим прямые эфиры с экспертами в области дизайна и здоровья, где вы сможете задать интересующие Вас вопросы. А еще всех подписчиков канала ждут розыгрыши, конкурсы и увлекательные активности🔥\n\n'
        'В телеграм-канале MirrorSleep Вы подробно познакомитесь со всем ассортиментом бренда и сможете подобрать подарок близким. Широкий выбор продукции позволит выбрать практичный и нужный презент. При этом минималистичная упаковка с лентами придаст ему презентабельности и подчеркнет высокое качество.\n\n'
        'Присоединяйтесь по ссылке 👉 <a href="https://t.me/mirrorsleep">здесь</a>\n\n'
        'С заботой о Вашем комфорте, команда MirrorSleep.'
    ),
   "friendship": (
        "Надеемся, что Ваш первый заказ станет началом нашей долгой дружбы.\n\n"
        "Мы создали этот чат-бот, чтобы Вы раньше других узнавали о новинках, акциях, скидках и лучших публикациях блога MirrorSleep. Здесь же Вы будете получать подарки к праздникам и знакомиться с эксклюзивными предложениями.\n"
        "Гарантируем, что рассылка будет приходить <b>не чаще 1 раза в месяц!</b>\n\n"
        "При этом Служба заботы бренда всегда остается на связи и в любой момент готова прийти на помощь."
    ),
    "questions": (
        "Сейчас мы хотим познакомиться поближе и задать несколько вопросов. Это поможет нам сформировать персональные предложения, которые подойдут именно Вам.\n\n"
        "⭐️За заполнение анкеты Вы получите промокод на скидку - 500 руб.\n"
        "Применить его можно будет лично или передать близким.\n"
        "Срок действия бонуса - 6 месяцев."
    ),
    "info_use": (
        "Вся полученная нами информация будет использована только компанией MirrorSleep, без передачи третьими лицам."
    ),
    "choose_platform": (
        "Выберете площадку, на которой приобретали нашу продукцию."
    ),
    "order_number_request": (
        "Заполните номер Вашего заказа. Найти его можно в приложении маркетплейса, используя инструкцию ⤵️."
    ),
    "order_number_prompt": (
        "Укажите номер заказа обратным сообщением."
    ),
    "contact_request": (
        "Просим оставить Вас свои контактные данные.\n"
        "Это поможет нам всегда оставаться на связи. Мы хотим, чтобы Вы не пропускали спецпредложения MirrorSleep и покупали наши товары максимально выгодно."
    ),
    "contact_button": (
        "Заполните номер телефона, нажав на кнопку 'Поделиться контактом'."
    ),
    "email_request": (
        "Отправьте обратным сообщением адрес электронной почты при её наличии."
    ),
    "birthday_request": (
        "Заполните дату своего рождения. Чтобы мы могли поздравлять Вас с этим особым днём и дарить ценные подарки."
    ),
    "feedback": (
        "MirrorSleep - молодой и амбициозный бренд. Нам важно, чтобы наши изделия приносили радость клиентам и получали положительный отклик.\n\n"
        "Мы уверены, что Ваше честное мнение сделает нас лучше.\n"
        "Если у Вас возникли проблемы с качеством товара, его доставкой или упаковкой, обязательно расскажите об этом. Наша команда учтёт все пожелания и исправит недостатки.\n\n"
        "Нам будет полезно услышать любую обратную связь и получить искренние отзывы."
    ),
    "feedback_form": (
        "Форма для обратной связи\n"
        'Telegram канал – <a href="https://t.me/channel_link">Службы заботы</a>'
    ),
    "thank_you": (
        "Спасибо за ответы!\n"
        "Ваше кодовое слово: SLEEP.\n"
        "Напоминаем, что срок действия промокода - 6 месяцев с момента его получения.\n"
        "Сумма скидки - 500 р."
    )
}

photo_paths = {
    'Ozon': [
        {
            'path': 'photo/instructions/ozon/ozon_step_1.png',
            'text': 'Заходим в приложение Ozon, далее переходим в личный кабинет, для этого необходимо нажать на иконку в правом нижнем услугу.'
        },
        {
            'path': 'photo/instructions/ozon/ozon_step_2.png',
            'text': 'Далее листаем вниз страницы и находим кнопку Заказы, нажимаем на нее.'
        },
        {
            'path': 'photo/instructions/ozon/ozon_step_3.png',
            'text': 'Далее находим наш заказ, переходим в него.'
        },
        {
            'path': 'photo/instructions/ozon/ozon_step_4.png',
            'text': 'Далее копируем наш номер заказа.'
        }
    ],
    'Wildberries': [
        {
            'path': 'photo/instructions/wb/payment_icons_step_1.png',
            'text': 'Заходим в приложение Wildberries, далее переходим в личный кабинет, для этого необходимо нажать на иконку в правом нижнем услугу.'
        }, 
        {
            'path': 'photo/instructions/wb/finance_step_2.png',
            'text': 'Далее листаем вниз страницы и находим кнопку Финансы, нажимаем на нее.'
        }, 
        {
            'path': 'photo/instructions/wb/electronic_check_step_3.png',
            'text': 'Далее выбираем вкладку Электронные чеки (Эл. Чеки) и находим покупку нашего продукта, переходим в нужный чек.'
        }, 
        {
            'path': 'photo/instructions/wb/cheque_step_4.png',
            'text': 'Находим в чеке покупку у бренда “Mirror Sleep” и копируем номер заказа.'
        }
    ],
    'Мегамаркет': [
        {
            'path': 'photo/instructions/megamarket/megamarket_step_1.png',
            'text': 'Заходим в приложение Мегамаркет, далее переходим в личный кабинет, для этого необходимо нажать на иконку в правом нижнем услугу.'
        },
        {
            'path': 'photo/instructions/megamarket/megamarket_step_2.png',
            'text': 'Далее листаем вниз, находим кнопку Заказы, нажимаем на нее.'
        },
        {
            'path': 'photo/instructions/megamarket/megamarket_step_3.png',
            'text': 'Далее находим наш заказ, переходим в него.'
        },
        {
            'path': 'photo/instructions/megamarket/megamarket_step_4.png',
            'text': 'Далее находим номер доставки (заказа) и копируем его.'
        }
    ],
    'ЯндексМаркет': [
        {
            'path': 'photo/instructions/yandex/yandex_step_1.png',
            'text': 'Заходим в приложение Яндекс маркет, далее переходим в личный кабинет, для этого необходимо нажать на иконку в правом нижнем услугу.'
        },
        {
            'path': 'photo/instructions/yandex/yandex_step_2.png',
            'text': 'Далее находим кнопку Заказы, нажимаем на нее.'
        },
        {
            'path': 'photo/instructions/yandex/yandex_step_3.png',
            'text': 'Далее находим наш заказ, переходим в него и копируем.'
        }
    ]
}

pdf_paths = {
    'Wildberries': 'documents/Order_Number_Instruction_WB.pdf'
}

(
    CONNECT, NAME_REQUEST, CONSENT, PLATFORM, ORDER_NUMBER, CONTACT, EMAIL, BIRTHDAY, FEEDBACK, FINAL, MAIN_MENU, PERSONAL_CABINET, ORDER_NUMBER_PROMPT
) = range(13)

category_cases = {
    'Постельное белье': 'постельном белье',
    'Полотенца': 'полотенцах',
    'Пледы': 'пледах'
}

platforms = [
    {"name": "Ozon", "callback_data": "Ozon"},
    {"name": "Wildberries", "callback_data": "Wildberries"},
    {"name": "Мегамаркет", "callback_data": "Мегамаркет"},
    {"name": "ЯндексМаркет", "callback_data": "ЯндексМаркет"}
]


backup={
    "subscribe_backup":(
        'Приглашаем Вас подписаться на наш <a href="https://t.me/mirrorsleep">Телеграм-канал</a>!\n\n'
        'Вы узнаете много полезной информации о <b>{category}</b> и уходе за ним. Каждую неделю мы проводим прямые эфиры с экспертами в области дизайна и здоровья, где вы сможете задать интересующие Вас вопросы. А еще всех подписчиков канала ждут розыгрыши, конкурсы и увлекательные активности🔥\n\n'
        'В телеграм-канале MirrorSleep Вы подробно познакомитесь со всем ассортиментом бренда и сможете подобрать подарок близким. Широкий выбор продукции позволит выбрать практичный и нужный презент. При этом минималистичная упаковка с лентами придаст ему презентабельности и подчеркнет высокое качество.\n\n'
        'Присоединяйтесь по ссылке 👉 <a href="https://t.me/mirrorsleep">здесь</a>\n\n'
        'Если у Вас возникли проблемы с качеством товара, его доставкой или упаковкой, обязательно расскажите об этом. Специально для общения с вами и решения проблем создан чат по заботе о клиентах.\n\n'
        'Присоединяйтесь по ссылке 👉 <a href="https://t.me/support_chat_link">здесь</a>\n\n'
        'С заботой о Вашем комфорте, команда MirrorSleep.'
    )
}